tests/shockTube/mhdPimpleFoam/SodShockTube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     mhdPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          1e-06;

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.1;

maxDeltaT       1;

functions
{
        sampleLine
        {
             type                    sets;
             libs                    (sampling);
             setFormat               raw;
             interpolationScheme     cell;
             writeControl            onEnd;
             enabled                 true;
             fields                  (U rho p B);
             sets
             (
                xAxis
                {
                    type        face;
                    axis        x;  
                    start       (-1 0 0); 
                    end         (1  0 0);
                }
              );
        }   
            
}

// ************************************************************************* //
