tests/shockTube/mhdPimpleFoam/SodShockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue T 0.00348432
    volScalarFieldValue p 1
    volVectorFieldValue B (0 0 0)
);

regions
(
    boxToCell
    {
        box (0.5 -0.1 -0.1) (1 0.1 0.1);
        fieldValues
        (
            volScalarFieldValue T 0.002787456
            volScalarFieldValue p 0.1
            volVectorFieldValue B (0 0 0)
        );
    }
);


// ************************************************************************* //
